espressif/esp-idf/components/soc/soc/esp32s2/include/soc/host_reg.h
#define HOST_SLCHOST_CONF_W6_REG          (DR_REG_SLCHOST_BASE + 0x88)
/* HOST_SLCHOST_CONF27 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF27  0x000000FF
#define HOST_SLCHOST_CONF27_M  ((HOST_SLCHOST_CONF27_V)<<(HOST_SLCHOST_CONF27_S))
#define HOST_SLCHOST_CONF27_V  0xFF
#define HOST_SLCHOST_CONF27_S  24
/* HOST_SLCHOST_CONF26 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF26  0x000000FF
#define HOST_SLCHOST_CONF26_M  ((HOST_SLCHOST_CONF26_V)<<(HOST_SLCHOST_CONF26_S))
#define HOST_SLCHOST_CONF26_V  0xFF
#define HOST_SLCHOST_CONF26_S  16
/* HOST_SLCHOST_CONF25 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF25  0x000000FF
#define HOST_SLCHOST_CONF25_M  ((HOST_SLCHOST_CONF25_V)<<(HOST_SLCHOST_CONF25_S))
#define HOST_SLCHOST_CONF25_V  0xFF
#define HOST_SLCHOST_CONF25_S  8
/* HOST_SLCHOST_CONF24 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF24  0x000000FF
#define HOST_SLCHOST_CONF24_M  ((HOST_SLCHOST_CONF24_V)<<(HOST_SLCHOST_CONF24_S))
#define HOST_SLCHOST_CONF24_V  0xFF
#define HOST_SLCHOST_CONF24_S  0

#define HOST_SLCHOST_CONF_W7_REG          (DR_REG_SLCHOST_BASE + 0x8C)
/* HOST_SLCHOST_CONF31 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF31  0x000000FF
#define HOST_SLCHOST_CONF31_M  ((HOST_SLCHOST_CONF31_V)<<(HOST_SLCHOST_CONF31_S))
#define HOST_SLCHOST_CONF31_V  0xFF
#define HOST_SLCHOST_CONF31_S  24
/* HOST_SLCHOST_CONF30 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF30  0x000000FF
#define HOST_SLCHOST_CONF30_M  ((HOST_SLCHOST_CONF30_V)<<(HOST_SLCHOST_CONF30_S))
#define HOST_SLCHOST_CONF30_V  0xFF
#define HOST_SLCHOST_CONF30_S  16
/* HOST_SLCHOST_CONF29 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF29  0x000000FF
#define HOST_SLCHOST_CONF29_M  ((HOST_SLCHOST_CONF29_V)<<(HOST_SLCHOST_CONF29_S))
#define HOST_SLCHOST_CONF29_V  0xFF
#define HOST_SLCHOST_CONF29_S  8
/* HOST_SLCHOST_CONF28 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF28  0x000000FF
#define HOST_SLCHOST_CONF28_M  ((HOST_SLCHOST_CONF28_V)<<(HOST_SLCHOST_CONF28_S))
#define HOST_SLCHOST_CONF28_V  0xFF
#define HOST_SLCHOST_CONF28_S  0

#define HOST_SLCHOST_PKT_LEN0_REG          (DR_REG_SLCHOST_BASE + 0x90)
/* HOST_HOSTSLC0_LEN0_CHECK : RO ;bitpos:[31:20] ;default: 12'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN0_CHECK  0x00000FFF
#define HOST_HOSTSLC0_LEN0_CHECK_M  ((HOST_HOSTSLC0_LEN0_CHECK_V)<<(HOST_HOSTSLC0_LEN0_CHECK_S))
#define HOST_HOSTSLC0_LEN0_CHECK_V  0xFFF
#define HOST_HOSTSLC0_LEN0_CHECK_S  20
/* HOST_HOSTSLC0_LEN0 : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN0  0x000FFFFF
#define HOST_HOSTSLC0_LEN0_M  ((HOST_HOSTSLC0_LEN0_V)<<(HOST_HOSTSLC0_LEN0_S))
#define HOST_HOSTSLC0_LEN0_V  0xFFFFF
#define HOST_HOSTSLC0_LEN0_S  0

#define HOST_SLCHOST_PKT_LEN1_REG          (DR_REG_SLCHOST_BASE + 0x94)
/* HOST_HOSTSLC0_LEN1_CHECK : RO ;bitpos:[31:20] ;default: 10'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN1_CHECK  0x00000FFF
#define HOST_HOSTSLC0_LEN1_CHECK_M  ((HOST_HOSTSLC0_LEN1_CHECK_V)<<(HOST_HOSTSLC0_LEN1_CHECK_S))
#define HOST_HOSTSLC0_LEN1_CHECK_V  0xFFF
#define HOST_HOSTSLC0_LEN1_CHECK_S  20
/* HOST_HOSTSLC0_LEN1 : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN1  0x000FFFFF
#define HOST_HOSTSLC0_LEN1_M  ((HOST_HOSTSLC0_LEN1_V)<<(HOST_HOSTSLC0_LEN1_S))
#define HOST_HOSTSLC0_LEN1_V  0xFFFFF
#define HOST_HOSTSLC0_LEN1_S  0

#define HOST_SLCHOST_PKT_LEN2_REG          (DR_REG_SLCHOST_BASE + 0x98)
/* HOST_HOSTSLC0_LEN2_CHECK : RO ;bitpos:[31:20] ;default: 10'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN2_CHECK  0x00000FFF
#define HOST_HOSTSLC0_LEN2_CHECK_M  ((HOST_HOSTSLC0_LEN2_CHECK_V)<<(HOST_HOSTSLC0_LEN2_CHECK_S))
#define HOST_HOSTSLC0_LEN2_CHECK_V  0xFFF
#define HOST_HOSTSLC0_LEN2_CHECK_S  20
/* HOST_HOSTSLC0_LEN2 : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN2  0x000FFFFF
#define HOST_HOSTSLC0_LEN2_M  ((HOST_HOSTSLC0_LEN2_V)<<(HOST_HOSTSLC0_LEN2_S))
#define HOST_HOSTSLC0_LEN2_V  0xFFFFF
#define HOST_HOSTSLC0_LEN2_S  0

#define HOST_SLCHOST_CONF_W8_REG          (DR_REG_SLCHOST_BASE + 0x9C)
/* HOST_SLCHOST_CONF35 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF35  0x000000FF
#define HOST_SLCHOST_CONF35_M  ((HOST_SLCHOST_CONF35_V)<<(HOST_SLCHOST_CONF35_S))
#define HOST_SLCHOST_CONF35_V  0xFF
#define HOST_SLCHOST_CONF35_S  24
/* HOST_SLCHOST_CONF34 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF34  0x000000FF
#define HOST_SLCHOST_CONF34_M  ((HOST_SLCHOST_CONF34_V)<<(HOST_SLCHOST_CONF34_S))
#define HOST_SLCHOST_CONF34_V  0xFF
#define HOST_SLCHOST_CONF34_S  16
/* HOST_SLCHOST_CONF33 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF33  0x000000FF
#define HOST_SLCHOST_CONF33_M  ((HOST_SLCHOST_CONF33_V)<<(HOST_SLCHOST_CONF33_S))
#define HOST_SLCHOST_CONF33_V  0xFF
#define HOST_SLCHOST_CONF33_S  8
/* HOST_SLCHOST_CONF32 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF32  0x000000FF
#define HOST_SLCHOST_CONF32_M  ((HOST_SLCHOST_CONF32_V)<<(HOST_SLCHOST_CONF32_S))
#define HOST_SLCHOST_CONF32_V  0xFF
#define HOST_SLCHOST_CONF32_S  0

#define HOST_SLCHOST_CONF_W9_REG          (DR_REG_SLCHOST_BASE + 0xA0)
/* HOST_SLCHOST_CONF39 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF39  0x000000FF
#define HOST_SLCHOST_CONF39_M  ((HOST_SLCHOST_CONF39_V)<<(HOST_SLCHOST_CONF39_S))
#define HOST_SLCHOST_CONF39_V  0xFF
#define HOST_SLCHOST_CONF39_S  24
/* HOST_SLCHOST_CONF38 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF38  0x000000FF
#define HOST_SLCHOST_CONF38_M  ((HOST_SLCHOST_CONF38_V)<<(HOST_SLCHOST_CONF38_S))
#define HOST_SLCHOST_CONF38_V  0xFF
#define HOST_SLCHOST_CONF38_S  16
/* HOST_SLCHOST_CONF37 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF37  0x000000FF
#define HOST_SLCHOST_CONF37_M  ((HOST_SLCHOST_CONF37_V)<<(HOST_SLCHOST_CONF37_S))
#define HOST_SLCHOST_CONF37_V  0xFF
#define HOST_SLCHOST_CONF37_S  8
/* HOST_SLCHOST_CONF36 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF36  0x000000FF
#define HOST_SLCHOST_CONF36_M  ((HOST_SLCHOST_CONF36_V)<<(HOST_SLCHOST_CONF36_S))
#define HOST_SLCHOST_CONF36_V  0xFF
#define HOST_SLCHOST_CONF36_S  0

#define HOST_SLCHOST_CONF_W10_REG          (DR_REG_SLCHOST_BASE + 0xA4)
/* HOST_SLCHOST_CONF43 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF43  0x000000FF
#define HOST_SLCHOST_CONF43_M  ((HOST_SLCHOST_CONF43_V)<<(HOST_SLCHOST_CONF43_S))
#define HOST_SLCHOST_CONF43_V  0xFF
#define HOST_SLCHOST_CONF43_S  24
/* HOST_SLCHOST_CONF42 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF42  0x000000FF
#define HOST_SLCHOST_CONF42_M  ((HOST_SLCHOST_CONF42_V)<<(HOST_SLCHOST_CONF42_S))
#define HOST_SLCHOST_CONF42_V  0xFF
#define HOST_SLCHOST_CONF42_S  16
/* HOST_SLCHOST_CONF41 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF41  0x000000FF
#define HOST_SLCHOST_CONF41_M  ((HOST_SLCHOST_CONF41_V)<<(HOST_SLCHOST_CONF41_S))
#define HOST_SLCHOST_CONF41_V  0xFF
#define HOST_SLCHOST_CONF41_S  8
/* HOST_SLCHOST_CONF40 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF40  0x000000FF
#define HOST_SLCHOST_CONF40_M  ((HOST_SLCHOST_CONF40_V)<<(HOST_SLCHOST_CONF40_S))
#define HOST_SLCHOST_CONF40_V  0xFF
#define HOST_SLCHOST_CONF40_S  0

